# Document Get Default Family Type Id Method

Source: https://www.revitapidocs.com/2026/34d20683-dfea-b1f8-14cf-750611b218ed.htm

---

| Document Get Default Family Type Id Method |
| --- |

Gets the default family type id with the given family category id.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId GetDefaultFamilyTypeId(
	ElementId familyCategoryId
)
```

```
Public Function GetDefaultFamilyTypeId (
	familyCategoryId As ElementId
) As ElementId
```

```
public:
ElementId^ GetDefaultFamilyTypeId(
	ElementId^ familyCategoryId
)
```

```
member GetDefaultFamilyTypeId :
        familyCategoryId : ElementId -> ElementId
```

#### Parameters

familyCategoryId ElementId
:   The family category id.

#### Return Value

ElementId
The default family type id. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | familyCategoryId is not a built in category or parameter Element ID. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

Document Class Autodesk.Revit.DB Namespace